backend/app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def getAllCategories
        @categories = Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def getAllAdsByCategory
        @categories = Category.find_by_id(params[:id])

INSERT INTO "categories" ("name", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Design"], ["slug", "design"], ["created_at", "2022-05-16 21:35:42.319353"], ["updated_at", "2022-05-16 21:35:42.319353"]]
---
    def createNewCategory
        @categories = Category.new(category_params)
        if @categories.save